# 22-09-05 Mon

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///db_univ7_new.db

In [3]:
%sql select dept_name from department

 * sqlite:///db_univ7_new.db
Done.

[('Biology',),
 ('Comp. Sci.',),
 ('Elec. Eng.',),
 ('Finance',),
 ('History',),
 ('Music',),
 ('Physics',)]

In [4]:
%sql select distinct dept_name from instructor

 * sqlite:///db_univ7_new.db
Done.

[('Comp. Sci.',),
 ('Finance',),
 ('Music',),
 ('Physics',),
 ('History',),
 ('Biology',),
 ('Elec. Eng.',)]

In [ ]:
%sql select '437' as FOO

In [ ]:
%sql select 'A' from instructor

In [ ]:
%sql select ID, name, salary/12 from  instructor

In [ ]:
%sql select ID, name, salary/12 as monthly_salary from  instructor

In [ ]:
%%sql select name
from instructor
where dept_name='Comp. Sci.' and salary > 70000

In [ ]:
%sql select * from instructor, teaches

In [ ]:
%sql select name, course_id from instructor, teaches where instructor.id = teaches.id

In [ ]:
%%sql select section.course_id, semester, year, title 
from section, course
where section.course_id = course.course_id and dept_name='Comp. Sci.'

In [ ]:
%sql select * from section

In [ ]:
%sql select * from course

In [ ]:
%sql select * from instructor as T, instructor as S

In [ ]:
%sql select distinct T. name from instructor as T, instructor as S where T.salary > S.salary and S.dept_name = 'Comp. Sci.'